grevaillot/svd_tools/headers/ATSAML11E14A/rtc.h
#pragma once 

/* --- RTC: Real-Time Counter --------------------------------------- */

/** @defgroup rtc_registers Real-Time Counter Register
@{*/

/** RTC_MODE0_CTRLA MODE0 Control A **/
#define RTC_MODE0_CTRLA			MMIO32(RTC_BASE + 0x00)
/** RTC_MODE1_CTRLA MODE1 Control A **/
#define RTC_MODE1_CTRLA			MMIO32(RTC_BASE + 0x00)
/** RTC_MODE2_CTRLA MODE2 Control A **/
#define RTC_MODE2_CTRLA			MMIO32(RTC_BASE + 0x00)
/** RTC_MODE0_CTRLB MODE0 Control B **/
#define RTC_MODE0_CTRLB			MMIO32(RTC_BASE + 0x02)
/** RTC_MODE1_CTRLB MODE1 Control B **/
#define RTC_MODE1_CTRLB			MMIO32(RTC_BASE + 0x02)
/** RTC_MODE2_CTRLB MODE2 Control B **/
#define RTC_MODE2_CTRLB			MMIO32(RTC_BASE + 0x02)
/** RTC_MODE0_EVCTRL MODE0 Event Control **/
#define RTC_MODE0_EVCTRL			MMIO32(RTC_BASE + 0x04)
/** RTC_MODE1_EVCTRL MODE1 Event Control **/
#define RTC_MODE1_EVCTRL			MMIO32(RTC_BASE + 0x04)
/** RTC_MODE2_EVCTRL MODE2 Event Control **/
#define RTC_MODE2_EVCTRL			MMIO32(RTC_BASE + 0x04)
/** RTC_MODE0_INTENCLR MODE0 Interrupt Enable Clear **/
#define RTC_MODE0_INTENCLR			MMIO32(RTC_BASE + 0x08)
/** RTC_MODE1_INTENCLR MODE1 Interrupt Enable Clear **/
#define RTC_MODE1_INTENCLR			MMIO32(RTC_BASE + 0x08)
/** RTC_MODE2_INTENCLR MODE2 Interrupt Enable Clear **/
#define RTC_MODE2_INTENCLR			MMIO32(RTC_BASE + 0x08)
/** RTC_MODE0_INTENSET MODE0 Interrupt Enable Set **/
#define RTC_MODE0_INTENSET			MMIO32(RTC_BASE + 0x0a)
/** RTC_MODE1_INTENSET MODE1 Interrupt Enable Set **/
#define RTC_MODE1_INTENSET			MMIO32(RTC_BASE + 0x0a)
/** RTC_MODE2_INTENSET MODE2 Interrupt Enable Set **/
#define RTC_MODE2_INTENSET			MMIO32(RTC_BASE + 0x0a)
/** RTC_MODE0_INTFLAG MODE0 Interrupt Flag Status and Clear **/
#define RTC_MODE0_INTFLAG			MMIO32(RTC_BASE + 0x0c)
/** RTC_MODE1_INTFLAG MODE1 Interrupt Flag Status and Clear **/
#define RTC_MODE1_INTFLAG			MMIO32(RTC_BASE + 0x0c)
/** RTC_MODE2_INTFLAG MODE2 Interrupt Flag Status and Clear **/
#define RTC_MODE2_INTFLAG			MMIO32(RTC_BASE + 0x0c)
/** RTC_MODE0_DBGCTRL Debug Control **/
#define RTC_MODE0_DBGCTRL			MMIO32(RTC_BASE + 0x0e)
/** RTC_MODE1_DBGCTRL Debug Control **/
#define RTC_MODE1_DBGCTRL			MMIO32(RTC_BASE + 0x0e)
/** RTC_MODE2_DBGCTRL Debug Control **/
#define RTC_MODE2_DBGCTRL			MMIO32(RTC_BASE + 0x0e)
/** RTC_MODE0_SYNCBUSY MODE0 Synchronization Busy Status **/
#define RTC_MODE0_SYNCBUSY			MMIO32(RTC_BASE + 0x10)
/** RTC_MODE1_SYNCBUSY MODE1 Synchronization Busy Status **/
#define RTC_MODE1_SYNCBUSY			MMIO32(RTC_BASE + 0x10)
/** RTC_MODE2_SYNCBUSY MODE2 Synchronization Busy Status **/
#define RTC_MODE2_SYNCBUSY			MMIO32(RTC_BASE + 0x10)
/** RTC_MODE0_FREQCORR Frequency Correction **/
#define RTC_MODE0_FREQCORR			MMIO32(RTC_BASE + 0x14)
/** RTC_MODE1_FREQCORR Frequency Correction **/
#define RTC_MODE1_FREQCORR			MMIO32(RTC_BASE + 0x14)
/** RTC_MODE2_FREQCORR Frequency Correction **/
#define RTC_MODE2_FREQCORR			MMIO32(RTC_BASE + 0x14)
/** RTC_MODE0_COUNT MODE0 Counter Value **/
#define RTC_MODE0_COUNT			MMIO32(RTC_BASE + 0x18)
/** RTC_MODE1_COUNT MODE1 Counter Value **/
#define RTC_MODE1_COUNT			MMIO32(RTC_BASE + 0x18)
/** RTC_MODE2_CLOCK MODE2 Clock Value **/
#define RTC_MODE2_CLOCK			MMIO32(RTC_BASE + 0x18)
/** RTC_MODE1_PER MODE1 Counter Period **/
#define RTC_MODE1_PER			MMIO32(RTC_BASE + 0x1c)
/** RTC_MODE0_COMP[%s] MODE0 Compare n Value **/
#define RTC_MODE0_COMP[%s]			MMIO32(RTC_BASE + 0x20)
/** RTC_MODE1_COMP[%s] MODE1 Compare n Value **/
#define RTC_MODE1_COMP[%s]			MMIO32(RTC_BASE + 0x20)
/** RTC_MODE2_MODE2_ALARM[0]_ALARM MODE2_ALARM Alarm n Value **/
#define RTC_MODE2_MODE2_ALARM[0]_ALARM			MMIO32(RTC_BASE + 0x20)
/** RTC_MODE2_MODE2_ALARM[0]_MASK MODE2_ALARM Alarm n Mask **/
#define RTC_MODE2_MODE2_ALARM[0]_MASK			MMIO32(RTC_BASE + 0x24)
/** RTC_MODE0_GP[%s] General Purpose **/
#define RTC_MODE0_GP[%s]			MMIO32(RTC_BASE + 0x40)
/** RTC_MODE1_GP[%s] General Purpose **/
#define RTC_MODE1_GP[%s]			MMIO32(RTC_BASE + 0x40)
/** RTC_MODE2_GP[%s] General Purpose **/
#define RTC_MODE2_GP[%s]			MMIO32(RTC_BASE + 0x40)
/** RTC_MODE0_TAMPCTRL Tamper Control **/
#define RTC_MODE0_TAMPCTRL			MMIO32(RTC_BASE + 0x60)
/** RTC_MODE1_TAMPCTRL Tamper Control **/
#define RTC_MODE1_TAMPCTRL			MMIO32(RTC_BASE + 0x60)
/** RTC_MODE2_TAMPCTRL Tamper Control **/
#define RTC_MODE2_TAMPCTRL			MMIO32(RTC_BASE + 0x60)
/** RTC_MODE0_TIMESTAMP MODE0 Timestamp **/
#define RTC_MODE0_TIMESTAMP			MMIO32(RTC_BASE + 0x64)
/** RTC_MODE1_TIMESTAMP MODE1 Timestamp **/
#define RTC_MODE1_TIMESTAMP			MMIO32(RTC_BASE + 0x64)
/** RTC_MODE2_TIMESTAMP MODE2 Timestamp **/
#define RTC_MODE2_TIMESTAMP			MMIO32(RTC_BASE + 0x64)
/** RTC_MODE0_TAMPID Tamper ID **/
#define RTC_MODE0_TAMPID			MMIO32(RTC_BASE + 0x68)
/** RTC_MODE1_TAMPID Tamper ID **/
#define RTC_MODE1_TAMPID			MMIO32(RTC_BASE + 0x68)
/** RTC_MODE2_TAMPID Tamper ID **/
#define RTC_MODE2_TAMPID			MMIO32(RTC_BASE + 0x68)
/** RTC_MODE0_TAMPCTRLB Tamper Control B **/
#define RTC_MODE0_TAMPCTRLB			MMIO32(RTC_BASE + 0x6c)
/** RTC_MODE1_TAMPCTRLB Tamper Control B **/
#define RTC_MODE1_TAMPCTRLB			MMIO32(RTC_BASE + 0x6c)
/** RTC_MODE2_TAMPCTRLB Tamper Control B **/
#define RTC_MODE2_TAMPCTRLB			MMIO32(RTC_BASE + 0x6c)

/**@}*/


/** @defgroup rtc_mode0_ctrla MODE0CTRLA MODE0 Control A
@{*/

/** RTC_MODE0_CTRLA_COUNTSYNC Count Read Synchronization Enable **/
#define RTC_MODE0_CTRLA_COUNTSYNC		(1 << 15)
/** RTC_MODE0_CTRLA_GPTRST GP Registers Reset On Tamper Enable **/
#define RTC_MODE0_CTRLA_GPTRST		(1 << 14)

#define RTC_MODE0_CTRLA_PRESCALER_SHIFT		8
#define RTC_MODE0_CTRLA_PRESCALER_MASK		0x0f
/** @defgroup rtc_mode0_ctrla_prescaler PRESCALER Prescaler
@{*/
/**@}*/

/** RTC_MODE0_CTRLA_MATCHCLR Clear on Match **/
#define RTC_MODE0_CTRLA_MATCHCLR		(1 << 7)

#define RTC_MODE0_CTRLA_MODE_SHIFT		2
#define RTC_MODE0_CTRLA_MODE_MASK		0x03
/** @defgroup rtc_mode0_ctrla_mode MODE Operating Mode
@{*/
/**@}*/

/** RTC_MODE0_CTRLA_ENABLE Enable **/
#define RTC_MODE0_CTRLA_ENABLE		(1 << 1)
/** RTC_MODE0_CTRLA_SWRST Software Reset **/
#define RTC_MODE0_CTRLA_SWRST		(1 << 0)

/**@}*/

/** @defgroup rtc_mode1_ctrla MODE1CTRLA MODE1 Control A
@{*/

