grevaillot/svd_tools/headers/ATSAML11E14A/rtc.h
/** RTC_MODE1_CTRLA_COUNTSYNC Count Read Synchronization Enable **/
#define RTC_MODE1_CTRLA_COUNTSYNC		(1 << 15)
/** RTC_MODE1_CTRLA_GPTRST GP Registers Reset On Tamper Enable **/
#define RTC_MODE1_CTRLA_GPTRST		(1 << 14)

#define RTC_MODE1_CTRLA_PRESCALER_SHIFT		8
#define RTC_MODE1_CTRLA_PRESCALER_MASK		0x0f
/** @defgroup rtc_mode1_ctrla_prescaler PRESCALER Prescaler
@{*/
/**@}*/


#define RTC_MODE1_CTRLA_MODE_SHIFT		2
#define RTC_MODE1_CTRLA_MODE_MASK		0x03
/** @defgroup rtc_mode1_ctrla_mode MODE Operating Mode
@{*/
/**@}*/

/** RTC_MODE1_CTRLA_ENABLE Enable **/
#define RTC_MODE1_CTRLA_ENABLE		(1 << 1)
/** RTC_MODE1_CTRLA_SWRST Software Reset **/
#define RTC_MODE1_CTRLA_SWRST		(1 << 0)

/**@}*/

/** @defgroup rtc_mode2_ctrla MODE2CTRLA MODE2 Control A
@{*/

/** RTC_MODE2_CTRLA_CLOCKSYNC Clock Read Synchronization Enable **/
#define RTC_MODE2_CTRLA_CLOCKSYNC		(1 << 15)
/** RTC_MODE2_CTRLA_GPTRST GP Registers Reset On Tamper Enable **/
#define RTC_MODE2_CTRLA_GPTRST		(1 << 14)

#define RTC_MODE2_CTRLA_PRESCALER_SHIFT		8
#define RTC_MODE2_CTRLA_PRESCALER_MASK		0x0f
/** @defgroup rtc_mode2_ctrla_prescaler PRESCALER Prescaler
@{*/
/**@}*/

/** RTC_MODE2_CTRLA_MATCHCLR Clear on Match **/
#define RTC_MODE2_CTRLA_MATCHCLR		(1 << 7)
/** RTC_MODE2_CTRLA_CLKREP Clock Representation **/
#define RTC_MODE2_CTRLA_CLKREP		(1 << 6)

#define RTC_MODE2_CTRLA_MODE_SHIFT		2
#define RTC_MODE2_CTRLA_MODE_MASK		0x03
/** @defgroup rtc_mode2_ctrla_mode MODE Operating Mode
@{*/
/**@}*/

/** RTC_MODE2_CTRLA_ENABLE Enable **/
#define RTC_MODE2_CTRLA_ENABLE		(1 << 1)
/** RTC_MODE2_CTRLA_SWRST Software Reset **/
#define RTC_MODE2_CTRLA_SWRST		(1 << 0)

/**@}*/

/** @defgroup rtc_mode0_ctrlb MODE0CTRLB MODE0 Control B
@{*/

/** RTC_MODE0_CTRLB_SEPTO Separate Tamper Outputs **/
#define RTC_MODE0_CTRLB_SEPTO		(1 << 15)

#define RTC_MODE0_CTRLB_ACTF_SHIFT		12
#define RTC_MODE0_CTRLB_ACTF_MASK		0x07
/** @defgroup rtc_mode0_ctrlb_actf ACTF Active Layer Frequency
@{*/
/**@}*/


#define RTC_MODE0_CTRLB_DEBF_SHIFT		8
#define RTC_MODE0_CTRLB_DEBF_MASK		0x07
/** @defgroup rtc_mode0_ctrlb_debf DEBF Debounce Frequency
@{*/
/**@}*/

/** RTC_MODE0_CTRLB_DMAEN DMA Enable **/
#define RTC_MODE0_CTRLB_DMAEN		(1 << 7)
/** RTC_MODE0_CTRLB_RTCOUT RTC Output Enable **/
#define RTC_MODE0_CTRLB_RTCOUT		(1 << 6)
/** RTC_MODE0_CTRLB_DEBASYNC Debouncer Asynchronous Enable **/
#define RTC_MODE0_CTRLB_DEBASYNC		(1 << 5)
/** RTC_MODE0_CTRLB_DEBMAJ Debouncer Majority Enable **/
#define RTC_MODE0_CTRLB_DEBMAJ		(1 << 4)
/** RTC_MODE0_CTRLB_GP0EN General Purpose 0 Enable **/
#define RTC_MODE0_CTRLB_GP0EN		(1 << 0)

/**@}*/

/** @defgroup rtc_mode1_ctrlb MODE1CTRLB MODE1 Control B
@{*/

/** RTC_MODE1_CTRLB_SEPTO Separate Tamper Outputs **/
#define RTC_MODE1_CTRLB_SEPTO		(1 << 15)

#define RTC_MODE1_CTRLB_ACTF_SHIFT		12
#define RTC_MODE1_CTRLB_ACTF_MASK		0x07
/** @defgroup rtc_mode1_ctrlb_actf ACTF Active Layer Frequency
@{*/
/**@}*/


#define RTC_MODE1_CTRLB_DEBF_SHIFT		8
#define RTC_MODE1_CTRLB_DEBF_MASK		0x07
/** @defgroup rtc_mode1_ctrlb_debf DEBF Debounce Frequency
@{*/
/**@}*/

/** RTC_MODE1_CTRLB_DMAEN DMA Enable **/
#define RTC_MODE1_CTRLB_DMAEN		(1 << 7)
/** RTC_MODE1_CTRLB_RTCOUT RTC Output Enable **/
#define RTC_MODE1_CTRLB_RTCOUT		(1 << 6)
/** RTC_MODE1_CTRLB_DEBASYNC Debouncer Asynchronous Enable **/
#define RTC_MODE1_CTRLB_DEBASYNC		(1 << 5)
/** RTC_MODE1_CTRLB_DEBMAJ Debouncer Majority Enable **/
#define RTC_MODE1_CTRLB_DEBMAJ		(1 << 4)
/** RTC_MODE1_CTRLB_GP0EN General Purpose 0 Enable **/
#define RTC_MODE1_CTRLB_GP0EN		(1 << 0)

/**@}*/

/** @defgroup rtc_mode2_ctrlb MODE2CTRLB MODE2 Control B
@{*/

/** RTC_MODE2_CTRLB_SEPTO Separate Tamper Outputs **/
#define RTC_MODE2_CTRLB_SEPTO		(1 << 15)

#define RTC_MODE2_CTRLB_ACTF_SHIFT		12
#define RTC_MODE2_CTRLB_ACTF_MASK		0x07
/** @defgroup rtc_mode2_ctrlb_actf ACTF Active Layer Frequency
@{*/
/**@}*/


#define RTC_MODE2_CTRLB_DEBF_SHIFT		8
#define RTC_MODE2_CTRLB_DEBF_MASK		0x07
/** @defgroup rtc_mode2_ctrlb_debf DEBF Debounce Frequency
@{*/
/**@}*/

/** RTC_MODE2_CTRLB_DMAEN DMA Enable **/
#define RTC_MODE2_CTRLB_DMAEN		(1 << 7)
/** RTC_MODE2_CTRLB_RTCOUT RTC Output Enable **/
#define RTC_MODE2_CTRLB_RTCOUT		(1 << 6)
/** RTC_MODE2_CTRLB_DEBASYNC Debouncer Asynchronous Enable **/
#define RTC_MODE2_CTRLB_DEBASYNC		(1 << 5)
/** RTC_MODE2_CTRLB_DEBMAJ Debouncer Majority Enable **/
#define RTC_MODE2_CTRLB_DEBMAJ		(1 << 4)
/** RTC_MODE2_CTRLB_GP0EN General Purpose 0 Enable **/
#define RTC_MODE2_CTRLB_GP0EN		(1 << 0)

/**@}*/

/** @defgroup rtc_mode0_evctrl MODE0EVCTRL MODE0 Event Control
@{*/

/** RTC_MODE0_EVCTRL_PERDEO Periodic Interval Daily Event Output Enable **/
#define RTC_MODE0_EVCTRL_PERDEO		(1 << 24)
/** RTC_MODE0_EVCTRL_TAMPEVEI Tamper Event Input Enable **/
#define RTC_MODE0_EVCTRL_TAMPEVEI		(1 << 16)
/** RTC_MODE0_EVCTRL_OVFEO Overflow Event Output Enable **/
#define RTC_MODE0_EVCTRL_OVFEO		(1 << 15)
/** RTC_MODE0_EVCTRL_TAMPEREO Tamper Event Output Enable **/
#define RTC_MODE0_EVCTRL_TAMPEREO		(1 << 14)
/** RTC_MODE0_EVCTRL_CMPEO0 Compare 0 Event Output Enable **/
#define RTC_MODE0_EVCTRL_CMPEO0		(1 << 8)
/** RTC_MODE0_EVCTRL_PEREO7 Periodic Interval 7 Event Output Enable **/
#define RTC_MODE0_EVCTRL_PEREO7		(1 << 7)
/** RTC_MODE0_EVCTRL_PEREO6 Periodic Interval 6 Event Output Enable **/
#define RTC_MODE0_EVCTRL_PEREO6		(1 << 6)
/** RTC_MODE0_EVCTRL_PEREO5 Periodic Interval 5 Event Output Enable **/
#define RTC_MODE0_EVCTRL_PEREO5		(1 << 5)
/** RTC_MODE0_EVCTRL_PEREO4 Periodic Interval 4 Event Output Enable **/
#define RTC_MODE0_EVCTRL_PEREO4		(1 << 4)
/** RTC_MODE0_EVCTRL_PEREO3 Periodic Interval 3 Event Output Enable **/
#define RTC_MODE0_EVCTRL_PEREO3		(1 << 3)
/** RTC_MODE0_EVCTRL_PEREO2 Periodic Interval 2 Event Output Enable **/
#define RTC_MODE0_EVCTRL_PEREO2		(1 << 2)
/** RTC_MODE0_EVCTRL_PEREO1 Periodic Interval 1 Event Output Enable **/
#define RTC_MODE0_EVCTRL_PEREO1		(1 << 1)
/** RTC_MODE0_EVCTRL_PEREO0 Periodic Interval 0 Event Output Enable **/
#define RTC_MODE0_EVCTRL_PEREO0		(1 << 0)

/**@}*/

/** @defgroup rtc_mode1_evctrl MODE1EVCTRL MODE1 Event Control
@{*/

/** RTC_MODE1_EVCTRL_PERDEO Periodic Interval Daily Event Output Enable **/
#define RTC_MODE1_EVCTRL_PERDEO		(1 << 24)
/** RTC_MODE1_EVCTRL_TAMPEVEI Tamper Event Input Enable **/
#define RTC_MODE1_EVCTRL_TAMPEVEI		(1 << 16)
/** RTC_MODE1_EVCTRL_OVFEO Overflow Event Output Enable **/
#define RTC_MODE1_EVCTRL_OVFEO		(1 << 15)
/** RTC_MODE1_EVCTRL_TAMPEREO Tamper Event Output Enable **/
#define RTC_MODE1_EVCTRL_TAMPEREO		(1 << 14)
/** RTC_MODE1_EVCTRL_CMPEO1 Compare 1 Event Output Enable **/
#define RTC_MODE1_EVCTRL_CMPEO1		(1 << 9)
/** RTC_MODE1_EVCTRL_CMPEO0 Compare 0 Event Output Enable **/
#define RTC_MODE1_EVCTRL_CMPEO0		(1 << 8)
/** RTC_MODE1_EVCTRL_PEREO7 Periodic Interval 7 Event Output Enable **/
#define RTC_MODE1_EVCTRL_PEREO7		(1 << 7)
/** RTC_MODE1_EVCTRL_PEREO6 Periodic Interval 6 Event Output Enable **/
#define RTC_MODE1_EVCTRL_PEREO6		(1 << 6)
/** RTC_MODE1_EVCTRL_PEREO5 Periodic Interval 5 Event Output Enable **/
#define RTC_MODE1_EVCTRL_PEREO5		(1 << 5)
/** RTC_MODE1_EVCTRL_PEREO4 Periodic Interval 4 Event Output Enable **/
#define RTC_MODE1_EVCTRL_PEREO4		(1 << 4)
/** RTC_MODE1_EVCTRL_PEREO3 Periodic Interval 3 Event Output Enable **/
#define RTC_MODE1_EVCTRL_PEREO3		(1 << 3)
/** RTC_MODE1_EVCTRL_PEREO2 Periodic Interval 2 Event Output Enable **/
#define RTC_MODE1_EVCTRL_PEREO2		(1 << 2)
/** RTC_MODE1_EVCTRL_PEREO1 Periodic Interval 1 Event Output Enable **/
#define RTC_MODE1_EVCTRL_PEREO1		(1 << 1)
/** RTC_MODE1_EVCTRL_PEREO0 Periodic Interval 0 Event Output Enable **/
#define RTC_MODE1_EVCTRL_PEREO0		(1 << 0)

/**@}*/

/** @defgroup rtc_mode2_evctrl MODE2EVCTRL MODE2 Event Control
@{*/

/** RTC_MODE2_EVCTRL_PERDEO Periodic Interval Daily Event Output Enable **/
#define RTC_MODE2_EVCTRL_PERDEO		(1 << 24)
/** RTC_MODE2_EVCTRL_TAMPEVEI Tamper Event Input Enable **/
#define RTC_MODE2_EVCTRL_TAMPEVEI		(1 << 16)
/** RTC_MODE2_EVCTRL_OVFEO Overflow Event Output Enable **/
#define RTC_MODE2_EVCTRL_OVFEO		(1 << 15)
/** RTC_MODE2_EVCTRL_TAMPEREO Tamper Event Output Enable **/
#define RTC_MODE2_EVCTRL_TAMPEREO		(1 << 14)
/** RTC_MODE2_EVCTRL_ALARMEO0 Alarm 0 Event Output Enable **/
#define RTC_MODE2_EVCTRL_ALARMEO0		(1 << 8)
/** RTC_MODE2_EVCTRL_PEREO7 Periodic Interval 7 Event Output Enable **/
#define RTC_MODE2_EVCTRL_PEREO7		(1 << 7)
/** RTC_MODE2_EVCTRL_PEREO6 Periodic Interval 6 Event Output Enable **/
#define RTC_MODE2_EVCTRL_PEREO6		(1 << 6)
/** RTC_MODE2_EVCTRL_PEREO5 Periodic Interval 5 Event Output Enable **/
#define RTC_MODE2_EVCTRL_PEREO5		(1 << 5)
/** RTC_MODE2_EVCTRL_PEREO4 Periodic Interval 4 Event Output Enable **/
#define RTC_MODE2_EVCTRL_PEREO4		(1 << 4)
/** RTC_MODE2_EVCTRL_PEREO3 Periodic Interval 3 Event Output Enable **/
#define RTC_MODE2_EVCTRL_PEREO3		(1 << 3)
/** RTC_MODE2_EVCTRL_PEREO2 Periodic Interval 2 Event Output Enable **/
#define RTC_MODE2_EVCTRL_PEREO2		(1 << 2)
/** RTC_MODE2_EVCTRL_PEREO1 Periodic Interval 1 Event Output Enable **/
#define RTC_MODE2_EVCTRL_PEREO1		(1 << 1)
/** RTC_MODE2_EVCTRL_PEREO0 Periodic Interval 0 Event Output Enable **/
#define RTC_MODE2_EVCTRL_PEREO0		(1 << 0)

/**@}*/

/** @defgroup rtc_mode0_intenclr MODE0INTENCLR MODE0 Interrupt Enable Clear
@{*/

/** RTC_MODE0_INTENCLR_OVF Overflow Interrupt Enable **/
#define RTC_MODE0_INTENCLR_OVF		(1 << 15)
/** RTC_MODE0_INTENCLR_TAMPER Tamper Enable **/
#define RTC_MODE0_INTENCLR_TAMPER		(1 << 14)
/** RTC_MODE0_INTENCLR_CMP0 Compare 0 Interrupt Enable **/
#define RTC_MODE0_INTENCLR_CMP0		(1 << 8)
/** RTC_MODE0_INTENCLR_PER7 Periodic Interval 7 Interrupt Enable **/
#define RTC_MODE0_INTENCLR_PER7		(1 << 7)
/** RTC_MODE0_INTENCLR_PER6 Periodic Interval 6 Interrupt Enable **/
#define RTC_MODE0_INTENCLR_PER6		(1 << 6)
/** RTC_MODE0_INTENCLR_PER5 Periodic Interval 5 Interrupt Enable **/
#define RTC_MODE0_INTENCLR_PER5		(1 << 5)
/** RTC_MODE0_INTENCLR_PER4 Periodic Interval 4 Interrupt Enable **/
#define RTC_MODE0_INTENCLR_PER4		(1 << 4)
/** RTC_MODE0_INTENCLR_PER3 Periodic Interval 3 Interrupt Enable **/
#define RTC_MODE0_INTENCLR_PER3		(1 << 3)
/** RTC_MODE0_INTENCLR_PER2 Periodic Interval 2 Interrupt Enable **/
#define RTC_MODE0_INTENCLR_PER2		(1 << 2)
/** RTC_MODE0_INTENCLR_PER1 Periodic Interval 1 Interrupt Enable **/
#define RTC_MODE0_INTENCLR_PER1		(1 << 1)
/** RTC_MODE0_INTENCLR_PER0 Periodic Interval 0 Interrupt Enable **/
#define RTC_MODE0_INTENCLR_PER0		(1 << 0)

/**@}*/

/** @defgroup rtc_mode1_intenclr MODE1INTENCLR MODE1 Interrupt Enable Clear
@{*/

/** RTC_MODE1_INTENCLR_OVF Overflow Interrupt Enable **/
#define RTC_MODE1_INTENCLR_OVF		(1 << 15)
/** RTC_MODE1_INTENCLR_TAMPER Tamper Enable **/
#define RTC_MODE1_INTENCLR_TAMPER		(1 << 14)
/** RTC_MODE1_INTENCLR_CMP1 Compare 1 Interrupt Enable **/
#define RTC_MODE1_INTENCLR_CMP1		(1 << 9)
/** RTC_MODE1_INTENCLR_CMP0 Compare 0 Interrupt Enable **/
#define RTC_MODE1_INTENCLR_CMP0		(1 << 8)
/** RTC_MODE1_INTENCLR_PER7 Periodic Interval 7 Interrupt Enable **/
#define RTC_MODE1_INTENCLR_PER7		(1 << 7)
/** RTC_MODE1_INTENCLR_PER6 Periodic Interval 6 Interrupt Enable **/
#define RTC_MODE1_INTENCLR_PER6		(1 << 6)
/** RTC_MODE1_INTENCLR_PER5 Periodic Interval 5 Interrupt Enable **/
#define RTC_MODE1_INTENCLR_PER5		(1 << 5)
/** RTC_MODE1_INTENCLR_PER4 Periodic Interval 4 Interrupt Enable **/
#define RTC_MODE1_INTENCLR_PER4		(1 << 4)
/** RTC_MODE1_INTENCLR_PER3 Periodic Interval 3 Interrupt Enable **/
#define RTC_MODE1_INTENCLR_PER3		(1 << 3)
/** RTC_MODE1_INTENCLR_PER2 Periodic Interval 2 Interrupt Enable **/
#define RTC_MODE1_INTENCLR_PER2		(1 << 2)
/** RTC_MODE1_INTENCLR_PER1 Periodic Interval 1 Interrupt Enable **/
#define RTC_MODE1_INTENCLR_PER1		(1 << 1)
/** RTC_MODE1_INTENCLR_PER0 Periodic Interval 0 Interrupt Enable **/
#define RTC_MODE1_INTENCLR_PER0		(1 << 0)

/**@}*/

/** @defgroup rtc_mode2_intenclr MODE2INTENCLR MODE2 Interrupt Enable Clear
@{*/

/** RTC_MODE2_INTENCLR_OVF Overflow Interrupt Enable **/
#define RTC_MODE2_INTENCLR_OVF		(1 << 15)
/** RTC_MODE2_INTENCLR_TAMPER Tamper Enable **/
#define RTC_MODE2_INTENCLR_TAMPER		(1 << 14)
/** RTC_MODE2_INTENCLR_ALARM0 Alarm 0 Interrupt Enable **/
#define RTC_MODE2_INTENCLR_ALARM0		(1 << 8)
/** RTC_MODE2_INTENCLR_PER7 Periodic Interval 7 Interrupt Enable **/
#define RTC_MODE2_INTENCLR_PER7		(1 << 7)
/** RTC_MODE2_INTENCLR_PER6 Periodic Interval 6 Interrupt Enable **/
#define RTC_MODE2_INTENCLR_PER6		(1 << 6)
/** RTC_MODE2_INTENCLR_PER5 Periodic Interval 5 Interrupt Enable **/
#define RTC_MODE2_INTENCLR_PER5		(1 << 5)
/** RTC_MODE2_INTENCLR_PER4 Periodic Interval 4 Interrupt Enable **/
#define RTC_MODE2_INTENCLR_PER4		(1 << 4)
/** RTC_MODE2_INTENCLR_PER3 Periodic Interval 3 Interrupt Enable **/
#define RTC_MODE2_INTENCLR_PER3		(1 << 3)
/** RTC_MODE2_INTENCLR_PER2 Periodic Interval 2 Interrupt Enable **/
#define RTC_MODE2_INTENCLR_PER2		(1 << 2)
/** RTC_MODE2_INTENCLR_PER1 Periodic Interval 1 Interrupt Enable **/
#define RTC_MODE2_INTENCLR_PER1		(1 << 1)
/** RTC_MODE2_INTENCLR_PER0 Periodic Interval 0 Interrupt Enable **/
#define RTC_MODE2_INTENCLR_PER0		(1 << 0)

/**@}*/

