grevaillot/svd_tools/headers/ATSAML11E14A/rtc.h
/** @defgroup rtc_mode0_intenset MODE0INTENSET MODE0 Interrupt Enable Set
@{*/

/** RTC_MODE0_INTENSET_OVF Overflow Interrupt Enable **/
#define RTC_MODE0_INTENSET_OVF		(1 << 15)
/** RTC_MODE0_INTENSET_TAMPER Tamper Enable **/
#define RTC_MODE0_INTENSET_TAMPER		(1 << 14)
/** RTC_MODE0_INTENSET_CMP0 Compare 0 Interrupt Enable **/
#define RTC_MODE0_INTENSET_CMP0		(1 << 8)
/** RTC_MODE0_INTENSET_PER7 Periodic Interval 7 Interrupt Enable **/
#define RTC_MODE0_INTENSET_PER7		(1 << 7)
/** RTC_MODE0_INTENSET_PER6 Periodic Interval 6 Interrupt Enable **/
#define RTC_MODE0_INTENSET_PER6		(1 << 6)
/** RTC_MODE0_INTENSET_PER5 Periodic Interval 5 Interrupt Enable **/
#define RTC_MODE0_INTENSET_PER5		(1 << 5)
/** RTC_MODE0_INTENSET_PER4 Periodic Interval 4 Interrupt Enable **/
#define RTC_MODE0_INTENSET_PER4		(1 << 4)
/** RTC_MODE0_INTENSET_PER3 Periodic Interval 3 Interrupt Enable **/
#define RTC_MODE0_INTENSET_PER3		(1 << 3)
/** RTC_MODE0_INTENSET_PER2 Periodic Interval 2 Interrupt Enable **/
#define RTC_MODE0_INTENSET_PER2		(1 << 2)
/** RTC_MODE0_INTENSET_PER1 Periodic Interval 1 Interrupt Enable **/
#define RTC_MODE0_INTENSET_PER1		(1 << 1)
/** RTC_MODE0_INTENSET_PER0 Periodic Interval 0 Interrupt Enable **/
#define RTC_MODE0_INTENSET_PER0		(1 << 0)

/**@}*/

/** @defgroup rtc_mode1_intenset MODE1INTENSET MODE1 Interrupt Enable Set
@{*/

/** RTC_MODE1_INTENSET_OVF Overflow Interrupt Enable **/
#define RTC_MODE1_INTENSET_OVF		(1 << 15)
/** RTC_MODE1_INTENSET_TAMPER Tamper Enable **/
#define RTC_MODE1_INTENSET_TAMPER		(1 << 14)
/** RTC_MODE1_INTENSET_CMP1 Compare 1 Interrupt Enable **/
#define RTC_MODE1_INTENSET_CMP1		(1 << 9)
/** RTC_MODE1_INTENSET_CMP0 Compare 0 Interrupt Enable **/
#define RTC_MODE1_INTENSET_CMP0		(1 << 8)
/** RTC_MODE1_INTENSET_PER7 Periodic Interval 7 Interrupt Enable **/
#define RTC_MODE1_INTENSET_PER7		(1 << 7)
/** RTC_MODE1_INTENSET_PER6 Periodic Interval 6 Interrupt Enable **/
#define RTC_MODE1_INTENSET_PER6		(1 << 6)
/** RTC_MODE1_INTENSET_PER5 Periodic Interval 5 Interrupt Enable **/
#define RTC_MODE1_INTENSET_PER5		(1 << 5)
/** RTC_MODE1_INTENSET_PER4 Periodic Interval 4 Interrupt Enable **/
#define RTC_MODE1_INTENSET_PER4		(1 << 4)
/** RTC_MODE1_INTENSET_PER3 Periodic Interval 3 Interrupt Enable **/
#define RTC_MODE1_INTENSET_PER3		(1 << 3)
/** RTC_MODE1_INTENSET_PER2 Periodic Interval 2 Interrupt Enable **/
#define RTC_MODE1_INTENSET_PER2		(1 << 2)
/** RTC_MODE1_INTENSET_PER1 Periodic Interval 1 Interrupt Enable **/
#define RTC_MODE1_INTENSET_PER1		(1 << 1)
/** RTC_MODE1_INTENSET_PER0 Periodic Interval 0 Interrupt Enable **/
#define RTC_MODE1_INTENSET_PER0		(1 << 0)

/**@}*/

/** @defgroup rtc_mode2_intenset MODE2INTENSET MODE2 Interrupt Enable Set
@{*/

/** RTC_MODE2_INTENSET_OVF Overflow Interrupt Enable **/
#define RTC_MODE2_INTENSET_OVF		(1 << 15)
/** RTC_MODE2_INTENSET_TAMPER Tamper Enable **/
#define RTC_MODE2_INTENSET_TAMPER		(1 << 14)
/** RTC_MODE2_INTENSET_ALARM0 Alarm 0 Interrupt Enable **/
#define RTC_MODE2_INTENSET_ALARM0		(1 << 8)
/** RTC_MODE2_INTENSET_PER7 Periodic Interval 7 Enable **/
#define RTC_MODE2_INTENSET_PER7		(1 << 7)
/** RTC_MODE2_INTENSET_PER6 Periodic Interval 6 Enable **/
#define RTC_MODE2_INTENSET_PER6		(1 << 6)
/** RTC_MODE2_INTENSET_PER5 Periodic Interval 5 Enable **/
#define RTC_MODE2_INTENSET_PER5		(1 << 5)
/** RTC_MODE2_INTENSET_PER4 Periodic Interval 4 Enable **/
#define RTC_MODE2_INTENSET_PER4		(1 << 4)
/** RTC_MODE2_INTENSET_PER3 Periodic Interval 3 Enable **/
#define RTC_MODE2_INTENSET_PER3		(1 << 3)
/** RTC_MODE2_INTENSET_PER2 Periodic Interval 2 Enable **/
#define RTC_MODE2_INTENSET_PER2		(1 << 2)
/** RTC_MODE2_INTENSET_PER1 Periodic Interval 1 Enable **/
#define RTC_MODE2_INTENSET_PER1		(1 << 1)
/** RTC_MODE2_INTENSET_PER0 Periodic Interval 0 Enable **/
#define RTC_MODE2_INTENSET_PER0		(1 << 0)

/**@}*/

/** @defgroup rtc_mode0_intflag MODE0INTFLAG MODE0 Interrupt Flag Status and Clear
@{*/

/** RTC_MODE0_INTFLAG_OVF Overflow **/
#define RTC_MODE0_INTFLAG_OVF		(1 << 15)
/** RTC_MODE0_INTFLAG_TAMPER Tamper **/
#define RTC_MODE0_INTFLAG_TAMPER		(1 << 14)
/** RTC_MODE0_INTFLAG_CMP0 Compare 0 **/
#define RTC_MODE0_INTFLAG_CMP0		(1 << 8)
/** RTC_MODE0_INTFLAG_PER7 Periodic Interval 7 **/
#define RTC_MODE0_INTFLAG_PER7		(1 << 7)
/** RTC_MODE0_INTFLAG_PER6 Periodic Interval 6 **/
#define RTC_MODE0_INTFLAG_PER6		(1 << 6)
/** RTC_MODE0_INTFLAG_PER5 Periodic Interval 5 **/
#define RTC_MODE0_INTFLAG_PER5		(1 << 5)
/** RTC_MODE0_INTFLAG_PER4 Periodic Interval 4 **/
#define RTC_MODE0_INTFLAG_PER4		(1 << 4)
/** RTC_MODE0_INTFLAG_PER3 Periodic Interval 3 **/
#define RTC_MODE0_INTFLAG_PER3		(1 << 3)
/** RTC_MODE0_INTFLAG_PER2 Periodic Interval 2 **/
#define RTC_MODE0_INTFLAG_PER2		(1 << 2)
/** RTC_MODE0_INTFLAG_PER1 Periodic Interval 1 **/
#define RTC_MODE0_INTFLAG_PER1		(1 << 1)
/** RTC_MODE0_INTFLAG_PER0 Periodic Interval 0 **/
#define RTC_MODE0_INTFLAG_PER0		(1 << 0)

/**@}*/

/** @defgroup rtc_mode1_intflag MODE1INTFLAG MODE1 Interrupt Flag Status and Clear
@{*/

/** RTC_MODE1_INTFLAG_OVF Overflow **/
#define RTC_MODE1_INTFLAG_OVF		(1 << 15)
/** RTC_MODE1_INTFLAG_TAMPER Tamper **/
#define RTC_MODE1_INTFLAG_TAMPER		(1 << 14)
/** RTC_MODE1_INTFLAG_CMP1 Compare 1 **/
#define RTC_MODE1_INTFLAG_CMP1		(1 << 9)
/** RTC_MODE1_INTFLAG_CMP0 Compare 0 **/
#define RTC_MODE1_INTFLAG_CMP0		(1 << 8)
/** RTC_MODE1_INTFLAG_PER7 Periodic Interval 7 **/
#define RTC_MODE1_INTFLAG_PER7		(1 << 7)
/** RTC_MODE1_INTFLAG_PER6 Periodic Interval 6 **/
#define RTC_MODE1_INTFLAG_PER6		(1 << 6)
/** RTC_MODE1_INTFLAG_PER5 Periodic Interval 5 **/
#define RTC_MODE1_INTFLAG_PER5		(1 << 5)
/** RTC_MODE1_INTFLAG_PER4 Periodic Interval 4 **/
#define RTC_MODE1_INTFLAG_PER4		(1 << 4)
/** RTC_MODE1_INTFLAG_PER3 Periodic Interval 3 **/
#define RTC_MODE1_INTFLAG_PER3		(1 << 3)
/** RTC_MODE1_INTFLAG_PER2 Periodic Interval 2 **/
#define RTC_MODE1_INTFLAG_PER2		(1 << 2)
/** RTC_MODE1_INTFLAG_PER1 Periodic Interval 1 **/
#define RTC_MODE1_INTFLAG_PER1		(1 << 1)
/** RTC_MODE1_INTFLAG_PER0 Periodic Interval 0 **/
#define RTC_MODE1_INTFLAG_PER0		(1 << 0)

/**@}*/

