grevaillot/svd_tools/headers/ATSAML11E14A/rtc.h
/** @defgroup rtc_mode2_intflag MODE2INTFLAG MODE2 Interrupt Flag Status and Clear
@{*/

/** RTC_MODE2_INTFLAG_OVF Overflow **/
#define RTC_MODE2_INTFLAG_OVF		(1 << 15)
/** RTC_MODE2_INTFLAG_TAMPER Tamper **/
#define RTC_MODE2_INTFLAG_TAMPER		(1 << 14)
/** RTC_MODE2_INTFLAG_ALARM0 Alarm 0 **/
#define RTC_MODE2_INTFLAG_ALARM0		(1 << 8)
/** RTC_MODE2_INTFLAG_PER7 Periodic Interval 7 **/
#define RTC_MODE2_INTFLAG_PER7		(1 << 7)
/** RTC_MODE2_INTFLAG_PER6 Periodic Interval 6 **/
#define RTC_MODE2_INTFLAG_PER6		(1 << 6)
/** RTC_MODE2_INTFLAG_PER5 Periodic Interval 5 **/
#define RTC_MODE2_INTFLAG_PER5		(1 << 5)
/** RTC_MODE2_INTFLAG_PER4 Periodic Interval 4 **/
#define RTC_MODE2_INTFLAG_PER4		(1 << 4)
/** RTC_MODE2_INTFLAG_PER3 Periodic Interval 3 **/
#define RTC_MODE2_INTFLAG_PER3		(1 << 3)
/** RTC_MODE2_INTFLAG_PER2 Periodic Interval 2 **/
#define RTC_MODE2_INTFLAG_PER2		(1 << 2)
/** RTC_MODE2_INTFLAG_PER1 Periodic Interval 1 **/
#define RTC_MODE2_INTFLAG_PER1		(1 << 1)
/** RTC_MODE2_INTFLAG_PER0 Periodic Interval 0 **/
#define RTC_MODE2_INTFLAG_PER0		(1 << 0)

/**@}*/

/** @defgroup rtc_mode0_dbgctrl MODE0DBGCTRL Debug Control
@{*/

/** RTC_MODE0_DBGCTRL_DBGRUN Run During Debug **/
#define RTC_MODE0_DBGCTRL_DBGRUN		(1 << 0)

/**@}*/

/** @defgroup rtc_mode1_dbgctrl MODE1DBGCTRL Debug Control
@{*/

/** RTC_MODE1_DBGCTRL_DBGRUN Run During Debug **/
#define RTC_MODE1_DBGCTRL_DBGRUN		(1 << 0)

/**@}*/

/** @defgroup rtc_mode2_dbgctrl MODE2DBGCTRL Debug Control
@{*/

/** RTC_MODE2_DBGCTRL_DBGRUN Run During Debug **/
#define RTC_MODE2_DBGCTRL_DBGRUN		(1 << 0)

/**@}*/

/** @defgroup rtc_mode0_syncbusy MODE0SYNCBUSY MODE0 Synchronization Busy Status
@{*/

/** RTC_MODE0_SYNCBUSY_GP1 General Purpose 1 Register Busy **/
#define RTC_MODE0_SYNCBUSY_GP1		(1 << 17)
/** RTC_MODE0_SYNCBUSY_GP0 General Purpose 0 Register Busy **/
#define RTC_MODE0_SYNCBUSY_GP0		(1 << 16)
/** RTC_MODE0_SYNCBUSY_COUNTSYNC Count Synchronization Enable Bit Busy **/
#define RTC_MODE0_SYNCBUSY_COUNTSYNC		(1 << 15)
/** RTC_MODE0_SYNCBUSY_COMP0 COMP 0 Register Busy **/
#define RTC_MODE0_SYNCBUSY_COMP0		(1 << 5)
/** RTC_MODE0_SYNCBUSY_COUNT COUNT Register Busy **/
#define RTC_MODE0_SYNCBUSY_COUNT		(1 << 3)
/** RTC_MODE0_SYNCBUSY_FREQCORR FREQCORR Register Busy **/
#define RTC_MODE0_SYNCBUSY_FREQCORR		(1 << 2)
/** RTC_MODE0_SYNCBUSY_ENABLE Enable Bit Busy **/
#define RTC_MODE0_SYNCBUSY_ENABLE		(1 << 1)
/** RTC_MODE0_SYNCBUSY_SWRST Software Reset Busy **/
#define RTC_MODE0_SYNCBUSY_SWRST		(1 << 0)

/**@}*/

/** @defgroup rtc_mode1_syncbusy MODE1SYNCBUSY MODE1 Synchronization Busy Status
@{*/

/** RTC_MODE1_SYNCBUSY_GP1 General Purpose 1 Register Busy **/
#define RTC_MODE1_SYNCBUSY_GP1		(1 << 17)
/** RTC_MODE1_SYNCBUSY_GP0 General Purpose 0 Register Busy **/
#define RTC_MODE1_SYNCBUSY_GP0		(1 << 16)
/** RTC_MODE1_SYNCBUSY_COUNTSYNC Count Synchronization Enable Bit Busy **/
#define RTC_MODE1_SYNCBUSY_COUNTSYNC		(1 << 15)
/** RTC_MODE1_SYNCBUSY_COMP1 COMP 1 Register Busy **/
#define RTC_MODE1_SYNCBUSY_COMP1		(1 << 6)
/** RTC_MODE1_SYNCBUSY_COMP0 COMP 0 Register Busy **/
#define RTC_MODE1_SYNCBUSY_COMP0		(1 << 5)
/** RTC_MODE1_SYNCBUSY_PER PER Register Busy **/
#define RTC_MODE1_SYNCBUSY_PER		(1 << 4)
/** RTC_MODE1_SYNCBUSY_COUNT COUNT Register Busy **/
#define RTC_MODE1_SYNCBUSY_COUNT		(1 << 3)
/** RTC_MODE1_SYNCBUSY_FREQCORR FREQCORR Register Busy **/
#define RTC_MODE1_SYNCBUSY_FREQCORR		(1 << 2)
/** RTC_MODE1_SYNCBUSY_ENABLE Enable Bit Busy **/
#define RTC_MODE1_SYNCBUSY_ENABLE		(1 << 1)
/** RTC_MODE1_SYNCBUSY_SWRST Software Reset Bit Busy **/
#define RTC_MODE1_SYNCBUSY_SWRST		(1 << 0)

/**@}*/

/** @defgroup rtc_mode2_syncbusy MODE2SYNCBUSY MODE2 Synchronization Busy Status
@{*/

/** RTC_MODE2_SYNCBUSY_GP1 General Purpose 1 Register Busy **/
#define RTC_MODE2_SYNCBUSY_GP1		(1 << 17)
/** RTC_MODE2_SYNCBUSY_GP0 General Purpose 0 Register Busy **/
#define RTC_MODE2_SYNCBUSY_GP0		(1 << 16)
/** RTC_MODE2_SYNCBUSY_CLOCKSYNC Clock Synchronization Enable Bit Busy **/
#define RTC_MODE2_SYNCBUSY_CLOCKSYNC		(1 << 15)
/** RTC_MODE2_SYNCBUSY_MASK0 MASK 0 Register Busy **/
#define RTC_MODE2_SYNCBUSY_MASK0		(1 << 11)
/** RTC_MODE2_SYNCBUSY_ALARM0 ALARM 0 Register Busy **/
#define RTC_MODE2_SYNCBUSY_ALARM0		(1 << 5)
/** RTC_MODE2_SYNCBUSY_CLOCK CLOCK Register Busy **/
#define RTC_MODE2_SYNCBUSY_CLOCK		(1 << 3)
/** RTC_MODE2_SYNCBUSY_FREQCORR FREQCORR Register Busy **/
#define RTC_MODE2_SYNCBUSY_FREQCORR		(1 << 2)
/** RTC_MODE2_SYNCBUSY_ENABLE Enable Bit Busy **/
#define RTC_MODE2_SYNCBUSY_ENABLE		(1 << 1)
/** RTC_MODE2_SYNCBUSY_SWRST Software Reset Bit Busy **/
#define RTC_MODE2_SYNCBUSY_SWRST		(1 << 0)

/**@}*/

/** @defgroup rtc_mode0_freqcorr MODE0FREQCORR Frequency Correction
@{*/

/** RTC_MODE0_FREQCORR_SIGN Correction Sign **/
#define RTC_MODE0_FREQCORR_SIGN		(1 << 7)

#define RTC_MODE0_FREQCORR_VALUE_SHIFT		0
#define RTC_MODE0_FREQCORR_VALUE_MASK		0x7f
/** @defgroup rtc_mode0_freqcorr_value VALUE Correction Value
@{*/
/**@}*/


/**@}*/

/** @defgroup rtc_mode1_freqcorr MODE1FREQCORR Frequency Correction
@{*/

/** RTC_MODE1_FREQCORR_SIGN Correction Sign **/
#define RTC_MODE1_FREQCORR_SIGN		(1 << 7)

#define RTC_MODE1_FREQCORR_VALUE_SHIFT		0
#define RTC_MODE1_FREQCORR_VALUE_MASK		0x7f
/** @defgroup rtc_mode1_freqcorr_value VALUE Correction Value
@{*/
/**@}*/


/**@}*/

/** @defgroup rtc_mode2_freqcorr MODE2FREQCORR Frequency Correction
@{*/

/** RTC_MODE2_FREQCORR_SIGN Correction Sign **/
#define RTC_MODE2_FREQCORR_SIGN		(1 << 7)

#define RTC_MODE2_FREQCORR_VALUE_SHIFT		0
#define RTC_MODE2_FREQCORR_VALUE_MASK		0x7f
/** @defgroup rtc_mode2_freqcorr_value VALUE Correction Value
@{*/
/**@}*/


/**@}*/

/** @defgroup rtc_mode0_count MODE0COUNT MODE0 Counter Value
@{*/


#define RTC_MODE0_COUNT_COUNT_SHIFT		0
#define RTC_MODE0_COUNT_COUNT_MASK		0xffffffff
/** @defgroup rtc_mode0_count_count COUNT Counter Value
@{*/
/**@}*/


/**@}*/

/** @defgroup rtc_mode1_count MODE1COUNT MODE1 Counter Value
@{*/


#define RTC_MODE1_COUNT_COUNT_SHIFT		0
#define RTC_MODE1_COUNT_COUNT_MASK		0xffff
/** @defgroup rtc_mode1_count_count COUNT Counter Value
@{*/
/**@}*/


/**@}*/

