grevaillot/svd_tools/headers/ATSAML11E14A/rtc.h
/** @defgroup rtc_mode2_clock MODE2CLOCK MODE2 Clock Value
@{*/


#define RTC_MODE2_CLOCK_YEAR_SHIFT		26
#define RTC_MODE2_CLOCK_YEAR_MASK		0x3f
/** @defgroup rtc_mode2_clock_year YEAR Year
@{*/
/**@}*/


#define RTC_MODE2_CLOCK_MONTH_SHIFT		22
#define RTC_MODE2_CLOCK_MONTH_MASK		0x0f
/** @defgroup rtc_mode2_clock_month MONTH Month
@{*/
/**@}*/


#define RTC_MODE2_CLOCK_DAY_SHIFT		17
#define RTC_MODE2_CLOCK_DAY_MASK		0x1f
/** @defgroup rtc_mode2_clock_day DAY Day
@{*/
/**@}*/


#define RTC_MODE2_CLOCK_HOUR_SHIFT		12
#define RTC_MODE2_CLOCK_HOUR_MASK		0x1f
/** @defgroup rtc_mode2_clock_hour HOUR Hour
@{*/
/**@}*/


#define RTC_MODE2_CLOCK_MINUTE_SHIFT		6
#define RTC_MODE2_CLOCK_MINUTE_MASK		0x3f
/** @defgroup rtc_mode2_clock_minute MINUTE Minute
@{*/
/**@}*/


#define RTC_MODE2_CLOCK_SECOND_SHIFT		0
#define RTC_MODE2_CLOCK_SECOND_MASK		0x3f
/** @defgroup rtc_mode2_clock_second SECOND Second
@{*/
/**@}*/


/**@}*/

/** @defgroup rtc_mode1_per MODE1PER MODE1 Counter Period
@{*/


#define RTC_MODE1_PER_PER_SHIFT		0
#define RTC_MODE1_PER_PER_MASK		0xffff
/** @defgroup rtc_mode1_per_per PER Counter Period
@{*/
/**@}*/


/**@}*/

/** @defgroup rtc_mode0_comp[%s] MODE0COMP[%s] MODE0 Compare n Value
@{*/


#define RTC_MODE0_COMP[%s]_COMP_SHIFT		0
#define RTC_MODE0_COMP[%s]_COMP_MASK		0xffffffff
/** @defgroup rtc_mode0_comp[%s]_comp COMP Compare Value
@{*/
/**@}*/


/**@}*/

/** @defgroup rtc_mode1_comp[%s] MODE1COMP[%s] MODE1 Compare n Value
@{*/


#define RTC_MODE1_COMP[%s]_COMP_SHIFT		0
#define RTC_MODE1_COMP[%s]_COMP_MASK		0xffff
/** @defgroup rtc_mode1_comp[%s]_comp COMP Compare Value
@{*/
/**@}*/


/**@}*/

/** @defgroup rtc_mode2_mode2_alarm[0]_alarm MODE2MODE2ALARM[0]ALARM MODE2_ALARM Alarm n Value
@{*/


#define RTC_MODE2_MODE2_ALARM[0]_ALARM_YEAR_SHIFT		26
#define RTC_MODE2_MODE2_ALARM[0]_ALARM_YEAR_MASK		0x3f
/** @defgroup rtc_mode2_mode2_alarm[0]_alarm_year YEAR Year
@{*/
/**@}*/


#define RTC_MODE2_MODE2_ALARM[0]_ALARM_MONTH_SHIFT		22
#define RTC_MODE2_MODE2_ALARM[0]_ALARM_MONTH_MASK		0x0f
/** @defgroup rtc_mode2_mode2_alarm[0]_alarm_month MONTH Month
@{*/
/**@}*/


#define RTC_MODE2_MODE2_ALARM[0]_ALARM_DAY_SHIFT		17
#define RTC_MODE2_MODE2_ALARM[0]_ALARM_DAY_MASK		0x1f
/** @defgroup rtc_mode2_mode2_alarm[0]_alarm_day DAY Day
@{*/
/**@}*/


#define RTC_MODE2_MODE2_ALARM[0]_ALARM_HOUR_SHIFT		12
#define RTC_MODE2_MODE2_ALARM[0]_ALARM_HOUR_MASK		0x1f
/** @defgroup rtc_mode2_mode2_alarm[0]_alarm_hour HOUR Hour
@{*/
/**@}*/


#define RTC_MODE2_MODE2_ALARM[0]_ALARM_MINUTE_SHIFT		6
#define RTC_MODE2_MODE2_ALARM[0]_ALARM_MINUTE_MASK		0x3f
/** @defgroup rtc_mode2_mode2_alarm[0]_alarm_minute MINUTE Minute
@{*/
/**@}*/


#define RTC_MODE2_MODE2_ALARM[0]_ALARM_SECOND_SHIFT		0
#define RTC_MODE2_MODE2_ALARM[0]_ALARM_SECOND_MASK		0x3f
/** @defgroup rtc_mode2_mode2_alarm[0]_alarm_second SECOND Second
@{*/
/**@}*/


/**@}*/

/** @defgroup rtc_mode2_mode2_alarm[0]_mask MODE2MODE2ALARM[0]MASK MODE2_ALARM Alarm n Mask
@{*/


#define RTC_MODE2_MODE2_ALARM[0]_MASK_SEL_SHIFT		0
#define RTC_MODE2_MODE2_ALARM[0]_MASK_SEL_MASK		0x07
/** @defgroup rtc_mode2_mode2_alarm[0]_mask_sel SEL Alarm Mask Selection
@{*/
/**@}*/


/**@}*/

/** @defgroup rtc_mode0_gp[%s] MODE0GP[%s] General Purpose
@{*/


#define RTC_MODE0_GP[%s]_GP_SHIFT		0
#define RTC_MODE0_GP[%s]_GP_MASK		0xffffffff
/** @defgroup rtc_mode0_gp[%s]_gp GP General Purpose
@{*/
/**@}*/


/**@}*/

/** @defgroup rtc_mode1_gp[%s] MODE1GP[%s] General Purpose
@{*/


#define RTC_MODE1_GP[%s]_GP_SHIFT		0
#define RTC_MODE1_GP[%s]_GP_MASK		0xffffffff
/** @defgroup rtc_mode1_gp[%s]_gp GP General Purpose
@{*/
/**@}*/


/**@}*/

/** @defgroup rtc_mode2_gp[%s] MODE2GP[%s] General Purpose
@{*/


#define RTC_MODE2_GP[%s]_GP_SHIFT		0
#define RTC_MODE2_GP[%s]_GP_MASK		0xffffffff
/** @defgroup rtc_mode2_gp[%s]_gp GP General Purpose
@{*/
/**@}*/


/**@}*/

/** @defgroup rtc_mode0_tampctrl MODE0TAMPCTRL Tamper Control
@{*/

/** RTC_MODE0_TAMPCTRL_DEBNC3 Debouncer Enable 3 **/
#define RTC_MODE0_TAMPCTRL_DEBNC3		(1 << 27)
/** RTC_MODE0_TAMPCTRL_DEBNC2 Debouncer Enable 2 **/
#define RTC_MODE0_TAMPCTRL_DEBNC2		(1 << 26)
/** RTC_MODE0_TAMPCTRL_DEBNC1 Debouncer Enable 1 **/
#define RTC_MODE0_TAMPCTRL_DEBNC1		(1 << 25)
/** RTC_MODE0_TAMPCTRL_DEBNC0 Debouncer Enable 0 **/
#define RTC_MODE0_TAMPCTRL_DEBNC0		(1 << 24)
/** RTC_MODE0_TAMPCTRL_TAMLVL3 Tamper Level Select 3 **/
#define RTC_MODE0_TAMPCTRL_TAMLVL3		(1 << 19)
/** RTC_MODE0_TAMPCTRL_TAMLVL2 Tamper Level Select 2 **/
#define RTC_MODE0_TAMPCTRL_TAMLVL2		(1 << 18)
/** RTC_MODE0_TAMPCTRL_TAMLVL1 Tamper Level Select 1 **/
#define RTC_MODE0_TAMPCTRL_TAMLVL1		(1 << 17)
/** RTC_MODE0_TAMPCTRL_TAMLVL0 Tamper Level Select 0 **/
#define RTC_MODE0_TAMPCTRL_TAMLVL0		(1 << 16)

#define RTC_MODE0_TAMPCTRL_IN3ACT_SHIFT		6
#define RTC_MODE0_TAMPCTRL_IN3ACT_MASK		0x03
/** @defgroup rtc_mode0_tampctrl_in3act IN3ACT Tamper Input 3 Action
@{*/
/**@}*/


#define RTC_MODE0_TAMPCTRL_IN2ACT_SHIFT		4
#define RTC_MODE0_TAMPCTRL_IN2ACT_MASK		0x03
/** @defgroup rtc_mode0_tampctrl_in2act IN2ACT Tamper Input 2 Action
@{*/
/**@}*/


#define RTC_MODE0_TAMPCTRL_IN1ACT_SHIFT		2
#define RTC_MODE0_TAMPCTRL_IN1ACT_MASK		0x03
/** @defgroup rtc_mode0_tampctrl_in1act IN1ACT Tamper Input 1 Action
@{*/
/**@}*/


#define RTC_MODE0_TAMPCTRL_IN0ACT_SHIFT		0
#define RTC_MODE0_TAMPCTRL_IN0ACT_MASK		0x03
/** @defgroup rtc_mode0_tampctrl_in0act IN0ACT Tamper Input 0 Action
@{*/
/**@}*/


/**@}*/

/** @defgroup rtc_mode1_tampctrl MODE1TAMPCTRL Tamper Control
@{*/

/** RTC_MODE1_TAMPCTRL_DEBNC3 Debouncer Enable 3 **/
#define RTC_MODE1_TAMPCTRL_DEBNC3		(1 << 27)
/** RTC_MODE1_TAMPCTRL_DEBNC2 Debouncer Enable 2 **/
#define RTC_MODE1_TAMPCTRL_DEBNC2		(1 << 26)
/** RTC_MODE1_TAMPCTRL_DEBNC1 Debouncer Enable 1 **/
#define RTC_MODE1_TAMPCTRL_DEBNC1		(1 << 25)
/** RTC_MODE1_TAMPCTRL_DEBNC0 Debouncer Enable 0 **/
#define RTC_MODE1_TAMPCTRL_DEBNC0		(1 << 24)
/** RTC_MODE1_TAMPCTRL_TAMLVL3 Tamper Level Select 3 **/
#define RTC_MODE1_TAMPCTRL_TAMLVL3		(1 << 19)
/** RTC_MODE1_TAMPCTRL_TAMLVL2 Tamper Level Select 2 **/
#define RTC_MODE1_TAMPCTRL_TAMLVL2		(1 << 18)
/** RTC_MODE1_TAMPCTRL_TAMLVL1 Tamper Level Select 1 **/
#define RTC_MODE1_TAMPCTRL_TAMLVL1		(1 << 17)
/** RTC_MODE1_TAMPCTRL_TAMLVL0 Tamper Level Select 0 **/
#define RTC_MODE1_TAMPCTRL_TAMLVL0		(1 << 16)

