grevaillot/svd_tools/headers/ATSAML11E14A/rtc.h
#define RTC_MODE1_TAMPCTRL_IN3ACT_SHIFT		6
#define RTC_MODE1_TAMPCTRL_IN3ACT_MASK		0x03
/** @defgroup rtc_mode1_tampctrl_in3act IN3ACT Tamper Input 3 Action
@{*/
/**@}*/


#define RTC_MODE1_TAMPCTRL_IN2ACT_SHIFT		4
#define RTC_MODE1_TAMPCTRL_IN2ACT_MASK		0x03
/** @defgroup rtc_mode1_tampctrl_in2act IN2ACT Tamper Input 2 Action
@{*/
/**@}*/


#define RTC_MODE1_TAMPCTRL_IN1ACT_SHIFT		2
#define RTC_MODE1_TAMPCTRL_IN1ACT_MASK		0x03
/** @defgroup rtc_mode1_tampctrl_in1act IN1ACT Tamper Input 1 Action
@{*/
/**@}*/


#define RTC_MODE1_TAMPCTRL_IN0ACT_SHIFT		0
#define RTC_MODE1_TAMPCTRL_IN0ACT_MASK		0x03
/** @defgroup rtc_mode1_tampctrl_in0act IN0ACT Tamper Input 0 Action
@{*/
/**@}*/


/**@}*/

/** @defgroup rtc_mode2_tampctrl MODE2TAMPCTRL Tamper Control
@{*/

/** RTC_MODE2_TAMPCTRL_DEBNC3 Debouncer Enable 3 **/
#define RTC_MODE2_TAMPCTRL_DEBNC3		(1 << 27)
/** RTC_MODE2_TAMPCTRL_DEBNC2 Debouncer Enable 2 **/
#define RTC_MODE2_TAMPCTRL_DEBNC2		(1 << 26)
/** RTC_MODE2_TAMPCTRL_DEBNC1 Debouncer Enable 1 **/
#define RTC_MODE2_TAMPCTRL_DEBNC1		(1 << 25)
/** RTC_MODE2_TAMPCTRL_DEBNC0 Debouncer Enable 0 **/
#define RTC_MODE2_TAMPCTRL_DEBNC0		(1 << 24)
/** RTC_MODE2_TAMPCTRL_TAMLVL3 Tamper Level Select 3 **/
#define RTC_MODE2_TAMPCTRL_TAMLVL3		(1 << 19)
/** RTC_MODE2_TAMPCTRL_TAMLVL2 Tamper Level Select 2 **/
#define RTC_MODE2_TAMPCTRL_TAMLVL2		(1 << 18)
/** RTC_MODE2_TAMPCTRL_TAMLVL1 Tamper Level Select 1 **/
#define RTC_MODE2_TAMPCTRL_TAMLVL1		(1 << 17)
/** RTC_MODE2_TAMPCTRL_TAMLVL0 Tamper Level Select 0 **/
#define RTC_MODE2_TAMPCTRL_TAMLVL0		(1 << 16)

#define RTC_MODE2_TAMPCTRL_IN3ACT_SHIFT		6
#define RTC_MODE2_TAMPCTRL_IN3ACT_MASK		0x03
/** @defgroup rtc_mode2_tampctrl_in3act IN3ACT Tamper Input 3 Action
@{*/
/**@}*/


#define RTC_MODE2_TAMPCTRL_IN2ACT_SHIFT		4
#define RTC_MODE2_TAMPCTRL_IN2ACT_MASK		0x03
/** @defgroup rtc_mode2_tampctrl_in2act IN2ACT Tamper Input 2 Action
@{*/
/**@}*/


#define RTC_MODE2_TAMPCTRL_IN1ACT_SHIFT		2
#define RTC_MODE2_TAMPCTRL_IN1ACT_MASK		0x03
/** @defgroup rtc_mode2_tampctrl_in1act IN1ACT Tamper Input 1 Action
@{*/
/**@}*/


#define RTC_MODE2_TAMPCTRL_IN0ACT_SHIFT		0
#define RTC_MODE2_TAMPCTRL_IN0ACT_MASK		0x03
/** @defgroup rtc_mode2_tampctrl_in0act IN0ACT Tamper Input 0 Action
@{*/
/**@}*/


/**@}*/

/** @defgroup rtc_mode0_timestamp MODE0TIMESTAMP MODE0 Timestamp
@{*/


#define RTC_MODE0_TIMESTAMP_COUNT_SHIFT		0
#define RTC_MODE0_TIMESTAMP_COUNT_MASK		0xffffffff
/** @defgroup rtc_mode0_timestamp_count COUNT Count Timestamp Value
@{*/
/**@}*/


/**@}*/

/** @defgroup rtc_mode1_timestamp MODE1TIMESTAMP MODE1 Timestamp
@{*/


#define RTC_MODE1_TIMESTAMP_COUNT_SHIFT		0
#define RTC_MODE1_TIMESTAMP_COUNT_MASK		0xffff
/** @defgroup rtc_mode1_timestamp_count COUNT Count Timestamp Value
@{*/
/**@}*/


/**@}*/

/** @defgroup rtc_mode2_timestamp MODE2TIMESTAMP MODE2 Timestamp
@{*/


#define RTC_MODE2_TIMESTAMP_YEAR_SHIFT		26
#define RTC_MODE2_TIMESTAMP_YEAR_MASK		0x3f
/** @defgroup rtc_mode2_timestamp_year YEAR Year Timestamp Value
@{*/
/**@}*/


#define RTC_MODE2_TIMESTAMP_MONTH_SHIFT		22
#define RTC_MODE2_TIMESTAMP_MONTH_MASK		0x0f
/** @defgroup rtc_mode2_timestamp_month MONTH Month Timestamp Value
@{*/
/**@}*/


#define RTC_MODE2_TIMESTAMP_DAY_SHIFT		17
#define RTC_MODE2_TIMESTAMP_DAY_MASK		0x1f
/** @defgroup rtc_mode2_timestamp_day DAY Day Timestamp Value
@{*/
/**@}*/


#define RTC_MODE2_TIMESTAMP_HOUR_SHIFT		12
#define RTC_MODE2_TIMESTAMP_HOUR_MASK		0x1f
/** @defgroup rtc_mode2_timestamp_hour HOUR Hour Timestamp Value
@{*/
/**@}*/


#define RTC_MODE2_TIMESTAMP_MINUTE_SHIFT		6
#define RTC_MODE2_TIMESTAMP_MINUTE_MASK		0x3f
/** @defgroup rtc_mode2_timestamp_minute MINUTE Minute Timestamp Value
@{*/
/**@}*/


#define RTC_MODE2_TIMESTAMP_SECOND_SHIFT		0
#define RTC_MODE2_TIMESTAMP_SECOND_MASK		0x3f
/** @defgroup rtc_mode2_timestamp_second SECOND Second Timestamp Value
@{*/
/**@}*/


/**@}*/

/** @defgroup rtc_mode0_tampid MODE0TAMPID Tamper ID
@{*/

/** RTC_MODE0_TAMPID_TAMPEVT Tamper Event Detected **/
#define RTC_MODE0_TAMPID_TAMPEVT		(1 << 31)
/** RTC_MODE0_TAMPID_TAMPID3 Tamper Input 3 Detected **/
#define RTC_MODE0_TAMPID_TAMPID3		(1 << 3)
/** RTC_MODE0_TAMPID_TAMPID2 Tamper Input 2 Detected **/
#define RTC_MODE0_TAMPID_TAMPID2		(1 << 2)
/** RTC_MODE0_TAMPID_TAMPID1 Tamper Input 1 Detected **/
#define RTC_MODE0_TAMPID_TAMPID1		(1 << 1)
/** RTC_MODE0_TAMPID_TAMPID0 Tamper Input 0 Detected **/
#define RTC_MODE0_TAMPID_TAMPID0		(1 << 0)

/**@}*/

/** @defgroup rtc_mode1_tampid MODE1TAMPID Tamper ID
@{*/

/** RTC_MODE1_TAMPID_TAMPEVT Tamper Event Detected **/
#define RTC_MODE1_TAMPID_TAMPEVT		(1 << 31)
/** RTC_MODE1_TAMPID_TAMPID3 Tamper Input 3 Detected **/
#define RTC_MODE1_TAMPID_TAMPID3		(1 << 3)
/** RTC_MODE1_TAMPID_TAMPID2 Tamper Input 2 Detected **/
#define RTC_MODE1_TAMPID_TAMPID2		(1 << 2)
/** RTC_MODE1_TAMPID_TAMPID1 Tamper Input 1 Detected **/
#define RTC_MODE1_TAMPID_TAMPID1		(1 << 1)
/** RTC_MODE1_TAMPID_TAMPID0 Tamper Input 0 Detected **/
#define RTC_MODE1_TAMPID_TAMPID0		(1 << 0)

/**@}*/

/** @defgroup rtc_mode2_tampid MODE2TAMPID Tamper ID
@{*/

/** RTC_MODE2_TAMPID_TAMPEVT Tamper Event Detected **/
#define RTC_MODE2_TAMPID_TAMPEVT		(1 << 31)
/** RTC_MODE2_TAMPID_TAMPID3 Tamper Input 3 Detected **/
#define RTC_MODE2_TAMPID_TAMPID3		(1 << 3)
/** RTC_MODE2_TAMPID_TAMPID2 Tamper Input 2 Detected **/
#define RTC_MODE2_TAMPID_TAMPID2		(1 << 2)
/** RTC_MODE2_TAMPID_TAMPID1 Tamper Input 1 Detected **/
#define RTC_MODE2_TAMPID_TAMPID1		(1 << 1)
/** RTC_MODE2_TAMPID_TAMPID0 Tamper Input 0 Detected **/
#define RTC_MODE2_TAMPID_TAMPID0		(1 << 0)

/**@}*/

/** @defgroup rtc_mode0_tampctrlb MODE0TAMPCTRLB Tamper Control B
@{*/

/** RTC_MODE0_TAMPCTRLB_ALSI3 Active Layer Select Internal 3 **/
#define RTC_MODE0_TAMPCTRLB_ALSI3		(1 << 3)
/** RTC_MODE0_TAMPCTRLB_ALSI2 Active Layer Select Internal 2 **/
#define RTC_MODE0_TAMPCTRLB_ALSI2		(1 << 2)
/** RTC_MODE0_TAMPCTRLB_ALSI1 Active Layer Select Internal 1 **/
#define RTC_MODE0_TAMPCTRLB_ALSI1		(1 << 1)
/** RTC_MODE0_TAMPCTRLB_ALSI0 Active Layer Select Internal 0 **/
#define RTC_MODE0_TAMPCTRLB_ALSI0		(1 << 0)

/**@}*/

/** @defgroup rtc_mode1_tampctrlb MODE1TAMPCTRLB Tamper Control B
@{*/

/** RTC_MODE1_TAMPCTRLB_ALSI3 Active Layer Select Internal 3 **/
#define RTC_MODE1_TAMPCTRLB_ALSI3		(1 << 3)
/** RTC_MODE1_TAMPCTRLB_ALSI2 Active Layer Select Internal 2 **/
#define RTC_MODE1_TAMPCTRLB_ALSI2		(1 << 2)
/** RTC_MODE1_TAMPCTRLB_ALSI1 Active Layer Select Internal 1 **/
#define RTC_MODE1_TAMPCTRLB_ALSI1		(1 << 1)
/** RTC_MODE1_TAMPCTRLB_ALSI0 Active Layer Select Internal 0 **/
#define RTC_MODE1_TAMPCTRLB_ALSI0		(1 << 0)

/**@}*/

/** @defgroup rtc_mode2_tampctrlb MODE2TAMPCTRLB Tamper Control B
@{*/

/** RTC_MODE2_TAMPCTRLB_ALSI3 Active Layer Select Internal 3 **/
#define RTC_MODE2_TAMPCTRLB_ALSI3		(1 << 3)
/** RTC_MODE2_TAMPCTRLB_ALSI2 Active Layer Select Internal 2 **/
#define RTC_MODE2_TAMPCTRLB_ALSI2		(1 << 2)
/** RTC_MODE2_TAMPCTRLB_ALSI1 Active Layer Select Internal 1 **/
#define RTC_MODE2_TAMPCTRLB_ALSI1		(1 << 1)
/** RTC_MODE2_TAMPCTRLB_ALSI0 Active Layer Select Internal 0 **/
#define RTC_MODE2_TAMPCTRLB_ALSI0		(1 << 0)

/**@}*/
